{
    portfolioItems:
    [
        {
            title: "Double-Take Console",
            thumbnail: "images/pf_UnifiedConsoleHome_t.jpg",
            description: "The Double-Take Console is the next-generation management console for the entire Double-Take product line.",
            context: "The Double-Take product line included many different, often inconsistent, user interfaces tailored towards specific solutions. Customers were confused as to which UI should be used to solve which kind of problem.",
            solution: "We built a single management console application, using an internal extensibility architecture, to provide a consistent user interface for all Double-Take features.",
            like: "The overall design is very approachable and does a good job of bringing all of Double-Take's features \"under one roof.\" We paid very close attention to details, so that common Windows conventions (like multiple selection and Copy-to-Clipboard) would be available everywhere.",
            dislike: "The sheer complexity of the Double-Take product line makes it difficult to distill the product down to its essence. I would have liked to have spent more time truly understanding the most common scenarios so that we could have optimized more effectively for those cases.",
            images:
            [
                {
                    name: "Home",
                    thumb: "images/pf_UnifiedConsoleHome_t.jpg",
                    full: "images/pf_UnifiedConsoleHome.jpg"
                },
                {
                    name: "Manage Jobs",
                    thumb: "images/pf_UnifiedConsoleJobs_t.jpg",
                    full: "images/pf_UnifiedConsoleJobs.jpg"
                },
                {
                    name: "Server Details",
                    thumb: "images/pf_UnifiedConsoleSDetails_t.jpg",
                    full: "images/pf_UnifiedConsoleSDetails.jpg"
                },
                {
                    name: "Choose Data",
                    thumb: "images/pf_UnifiedConsoleData_t.jpg",
                    full: "images/pf_UnifiedConsoleData.jpg"
                }
            ]
        },
        {
            title: "DigitalWizard",
            thumbnail: "images/pf_DigitalWizardHome_t.jpg",
            description: "DigitalWizard was a free download and digital media manager which featured an intuitive and beautiful user interface.",
            context: "As digital content became more and more prevalent on the Internet, it became apparent that downloading and managing this content was still too hard for many users.",
            solution: "DigitalWizard was designed to be an approachable, non-technical, elegant solution to managing downloaded music, pictures, video, and applications. The idea was to built a slick, task-based interface that improved upon Windows Explorer's file management.",
            like: "I like the Web-like, task-based approach to the interface. I like the understated colors and vibrant icons. I think DigitalWizard did a good job of refactoring a familiar metaphor (the folder) into a less rigid shape.",
            dislike: "At smaller window sizes, the DigitalWizard interface includes a lot of text. This was initally inspired by the home pages of Yahoo, AOL, and others. I think that DigitalWizard's user interface could be improved by taking a more minimalistic approach, and including more whitespace.",
            images:
            [
                {
                    name: "Home",
                    thumb: "images/pf_DigitalWizardHome_t.jpg",
                    full: "images/pf_DigitalWizardHome.jpg"
                },
                {
                    name: "My Stuff",
                    thumb: "images/pf_DigitalWizardMyStuff_t.jpg",
                    full: "images/pf_DigitalWizardMyStuff.jpg"
                },
                {
                    name: "My Programs",
                    thumb: "images/pf_DigitalWizardMyProgams_t.jpg",
                    full: "images/pf_DigitalWizardMyProgams.jpg"
                },
                {
                    name: "File Details",
                    thumb: "images/pf_DigitalWizardFileDetails_t.jpg",
                    full: "images/pf_DigitalWizardFileDetails.jpg"
                }
            ]
        },
        {
            title: "Project Assistant",
            thumbnail: "images/pf_AsstHome_t.jpg",
            description: "A streamlined interface that adds a layer of simplicity on top of a powerful developer tools IDE.",
            context: "This developer IDE was always traditionally a very powerful tool. With that power, however, came enormous complexity. Even simple projects required detailed knowledge of the tool, and thus new users were often overwhelmed.",
            solution: "We added a \"layer of simplicity\" on top of the existing user interface. All the original, powerful tools are still available under the Setup Designer tab. However, the most common user tasks are grouped into a workflow-like Project Assistant. The Project Assistant improves upon a typical wizard design in that it is fully reentrant and allows random access to any step.",
            like: "I love how the Project Assistant allows a simple, approachable interface to coexist with a set of powerful tools. I also love the color scheme that was designed by the creative team. (The two bluish images are early concepts.)",
            dislike: "The first implementation of the Project Assistant has some minor imperfections in terms of font, spacing, and icons.",
            images:
            [
                {
                    name: "Home",
                    thumb: "images/pf_AsstHome_t.jpg",
                    full: "images/pf_AsstHome.jpg"
                },
                {
                    name: "Setup Architecture",
                    thumb: "images/pf_AsstSetup_t.jpg",
                    full: "images/pf_AsstSetup.jpg"
                },
                {
                    name: "Files and Folders",
                    thumb: "images/pf_AsstFiles_t.jpg",
                    full: "images/pf_AsstFiles.jpg"
                },
                {
                    name: "General Information",
                    thumb: "images/pf_AsstGeneral_t.jpg",
                    full: "images/pf_AsstGeneral.jpg"
                }
            ]
        },
        {
            title: "Visual Guidelines",
            thumbnail: "images/pf_ISVGHome_t.jpg",
            description: "Visual guidelines that define company-wide standards for user interface design.",
            context: "The company needed a central repository of user interface design standards and guidance, which it had never had before.",
            solution: "The guidelines are a Web-based series of short topics which provide specific hints and requirements for designing user interface elements (wizards, dialog boxes, etc.). The content has a comprehensive index, is searchable, and includes many visual examples.",
            like: "I think we did a very good job of improving upon other guideline works (such as The Windows User Experience) by skipping some of the more theoretical information and jumping straight to specific guidelines. I also love the overall visual theme and color scheme.",
            dislike: "I am quite happy with the visual design; I would like to improve the accessibility and searchability of the content.",
            images:
            [
                {
                    name: "Home",
                    thumb: "images/pf_ISVGHome_t.jpg",
                    full: "images/pf_ISVGHome.jpg"
                },
                {
                    name: "Index",
                    thumb: "images/pf_ISVGIndex_t.jpg",
                    full: "images/pf_ISVGIndex.jpg"
                },
                {
                    name: "Dialog Boxes 1",
                    thumb: "images/pf_ISVGDlg1_t.jpg",
                    full: "images/pf_ISVGDlg1.jpg"
                },
                {
                    name: "Dialog Boxes 2",
                    thumb: "images/pf_ISVGDlg2_t.jpg",
                    full: "images/pf_ISVGDlg2.jpg"
                }
            ]
        },
        {
            title: "Developer Tools Poster",
            thumbnail: "images/pf_Poster7Exec_t.jpg",
            description: "A poster which visually communicates the composition of and execution of an installation.",
            context: "We needed a way to visually illustrate the composition and execution of a setup; this was something our employees take for granted, but many customers do not fully understand.",
            solution: "Our team set out to illustrate setup technology in a way that would make it clear to any user, and to create a piece that customers would want to keep. The top half of the poster illustrates the structure of a setup during design time, and the bottom half shows what happens when a setup is running.",
            like: "This poster is so beautiful and dense with information. I love how the dialog box that the end-user sees is linked to an InstallScript or Windows Installer event (bottom half of the poster).",
            dislike: "I would like to see even greater linkage between the structure and the execution portions. However, adding that information might make the poster too complex.",
            images:
            [
                {
                    name: "Version 7 Runtime",
                    thumb: "images/pf_Poster7Exec_t.jpg",
                    full: "images/pf_Poster7Exec.jpg"
                },
                {
                    name: "Version 7 Structure",
                    thumb: "images/pf_Poster7Top_t.jpg",
                    full: "images/pf_Poster7Top.jpg"
                },
                {
                    name: "Version 9 Poster",
                    thumb: "images/pf_Poster9_t.jpg",
                    full: "images/pf_Poster9.jpg"
                },
                {
                    name: "Version 9 Runtime",
                    thumb: "images/pf_Poster9Exec_t.jpg",
                    full: "images/pf_Poster9Exec.jpg"
                }
            ]
        },
        {
            title: "Dialog Boxes and Views",
            thumbnail: "images/pf_ProdNew_t.jpg",
            description: "A collection of views and dialog boxes from various desktop products.",
            context: "Developer tools need to pack a lot of features into familiar interface elements. Not only are the tools very powerful, the abstractions of the underlying concepts are often quite sophisticated. Also, developers expect that each user interface element will look and work according to industry standards.",
            solution: "Here we see a grid view layout, a dialog box, and a couple of wizard panels. Each item solves a different problem, and each mechanism is an appropriate choice given the problem domain.",
            like: "I like how the grid layout (borrowed heavily from Microsoft Visual Studio .NET) can accommodate a large amount of complex data, but it exhibits enough behavior (grouping, collapsing, et al.) that it can be made accessbile to less experienced users.",
            dislike: "There are always little things you'd like to fix... some wording here, some spacing there, some icon selection here. On whole, however, I'm pretty happy with how well these particular items do their job.",
            images:
            [
                {
                    name: "Grid View for Object Properties",
                    thumb: "images/pf_ProdGrid_t.jpg",
                    full: "images/pf_ProdGrid.jpg"
                },
                {
                    name: "New Project Dialog",
                    thumb: "images/pf_ProdNew_t.jpg",
                    full: "images/pf_ProdNew.jpg"
                },
                {
                    name: "Dialogs Wizard Panel",
                    thumb: "images/pf_ProdDlg_t.jpg",
                    full: "images/pf_ProdDlg.jpg"
                },
                {
                    name: "Registry Wizard Panel",
                    thumb: "images/pf_ProdReg_t.jpg",
                    full: "images/pf_ProdReg.jpg"
                }
            ]
        },
        {
            title: "Enterprise Web Application",
            thumbnail: "images/pf_AMSAdmin_t.jpg",
            description: "A Web-based application used by large enterprises to manage the lifecycle of their software assets.",
            context: "This application is an extremely complicated product for several reasons: It needs to manage massive amounts of data, it has enforce a workflow for multiple users and roles, and it has many different types of users (from CIOs down to entry-level application repackagers).",
            solution: "Early versions of this application were very heavy on grids, frames, and trees. This created an intensely intimating application, especially for one that runs over the Web. Our improved designs emphasized the tasks, chunked processes into discrete steps, and made effective use of iconography and whitespace.",
            like: "I like the segementation between the task links and the data links. The clean and simple header is striking, but it allows the white "workspace" to remain at center stage.",
            dislike: "These few screenshots are just a sample... There needs to be more internal consistency and visual linkage between different parts of the application. Also, there needs to be a single, unified navigation mechanism.",
            images:
            [
                {
                    name: "Administration",
                    thumb: "images/pf_AMSAdmin_t.jpg",
                    full: "images/pf_AMSAdmin.jpg"
                },
                {
                    name: "List",
                    thumb: "images/pf_AMSList_t.jpg",
                    full: "images/pf_AMSList.jpg"
                },
                {
                    name: "Application Details",
                    thumb: "images/pf_AMSApp_t.jpg",
                    full: "images/pf_AMSApp.jpg"
                },
                {
                    name: "Customer Portal",
                    thumb: "images/pf_AMSCustomer_t.jpg",
                    full: "images/pf_AMSCustomer.jpg"
                }
            ]
        },
        {
            title: "Error Handling",
            thumbnail: "images/pf_ErrorGPF_t.jpg",
            description: "These dialog boxes are designed to gracefully handle unexpected errors.",
            context: "Error messages generated by the end-user wizards and developer tools are often too technical and hard-to-understand.",
            solution: "We wanted to make error handling a high-priority aspect of the user interface. Using clean, simple designs and plain language are the most important techniques of error design. Also, when possible, always provide solutions for the user, and fix the problem automatically if feasible.",
            like: "I like how we turned a standard Windows application fault dialog box into a (somewhat) beautiful, simple dialog box.",
            dislike: "I would use only one Web link per dialog, never two.",
            images:
            [
                {
                    name: "Exception Handler",
                    thumb: "images/pf_ErrorGPF_t.jpg",
                    full: "images/pf_ErrorGPF.jpg"
                },
                {
                    name: "IDE Error Handler",
                    thumb: "images/pf_ErrorDev7_t.jpg",
                    full: "images/pf_ErrorDev7.jpg"
                },
                {
                    name: "Runtime Warning Handler",
                    thumb: "images/pf_ErrorWarning_t.jpg",
                    full: "images/pf_ErrorWarning.jpg"
                }
            ]
        },
        {
            title: "Mobile Medical Device Form",
            thumbnail: "images/pf_MDRF1_t.jpg",
            description: "This is a Pocket PC implementation of a formerly paper-based medical device registration form.",
            context: "A client who is a medical device manufacturer was moving from paper-based medical device registration forms (MDRFs) to electronic versions deployed on Pocket PC devices.",
            solution: "The original paper form was only one page, but it was very dense with information. Keeping with the design goals of the Pocket PC platform, it was necessary to split the form over several full-screen dialog boxes.",
            like: "I like how the data on the form has been segmented into a logical, wizard-like process. The design is compact, and user efficiency is improved through frequent use of drop-down lists and date-time pickers.",
            dislike: "It was important to the client to preserve some of the quirks of the original form. If I had the chance to completely re-design and optimize the form for the Pocket PC, I would have reorganized some fields and renamed some controls.",
            images:
            [
                {
                    name: "MDRF 1",
                    thumb: "images/pf_MDRF1_t.jpg",
                    full: "images/pf_MDRF1.jpg"
                },
                {
                    name: "MDRF 2",
                    thumb: "images/pf_MDRF2_t.jpg",
                    full: "images/pf_MDRF2.jpg"
                }
            ]
        },
        {
            title: "Icon Art",
            thumbnail: "images/pf_Icons_t.jpg",
            description: "A selection of icons for various uses.",
            context: "With the advent of Windows XP and Mac OS X, a new standard for icon design dawned for desktop developers. Old 16-color icons looked terribly out-of-date when running on these modern operating systems.",
            solution: "Many of these images are \"nothing new\": they\'ve been borrowed from other sources and modified to fit a need. I think one of the most important skills in icon design is to know when to borrow and how to leverage existing concepts.",
            like: "Fresh graphics can breath new life into an application or web site. I think we did a good job of refreshing some aging icons.",
            dislike: "I wish I was a better graphic artist.",
            images:
            [
                {
                    name: "Icons",
                    thumb: "images/pf_Icons_t.jpg",
                    full: "images/pf_Icons.jpg"
                }
            ]
        }
    ]
}
